<h2 style='color:purple' align='center'>Naive Bayes Tutorial Part 1: Predicting survival from titanic crash</h2>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
X = df[["Pclass", "Age", "Sex", "Fare"]]
y = df['Survived']

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
inputs = df.drop('Survived',axis='columns')
target = df['Survived']

In [6]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [7]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [8]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

**I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female**

In [9]:
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [10]:
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [11]:
inputs.Age.min()

0.42

In [12]:
inputs.Age.max()

80.0

In [13]:
df["Survived"][df.Age == df.Age.max()]

630    1
Name: Survived, dtype: int64

In [15]:
df[df.Age == df.Age.max()]

     Pclass   Sex   Age  Fare  Survived
630       1  male  80.0  30.0         1

In [16]:
891 - 714

177

In [17]:
print(inputs.Age.mean())
print(inputs.Age.median())

29.69911764705882
28.0

In [18]:
inputs.Age.std()

14.526497332334044

In [ ]:
0.4 ( 4 month ) 0.6 0.8 1  , 2 , 5, 6 , 7 , 7 ,7 , 8 , 10 , 
60 , 61 , 62, 63, .................. 80 
median = 14

In [19]:
inputs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Age     714 non-null    float64
 2   Fare    891 non-null    float64
 3   female  891 non-null    uint8
 4   male    891 non-null    uint8
dtypes: float64(2), int64(1), uint8(2)
memory usage: 22.7 KB

In [20]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [21]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [22]:
inputs.Age.min()

0.42

In [23]:
inputs.Age.max()

80.0

In [17]:
inputs.describe()

           Pclass         Age        Fare      female        male
count  891.000000  714.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118   32.204208    0.352413    0.647587
std      0.836071   14.526497   49.693429    0.477990    0.477990
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   20.125000    7.910400    0.000000    0.000000
50%      3.000000   28.000000   14.454200    0.000000    1.000000
75%      3.000000   38.000000   31.000000    1.000000    1.000000
max      3.000000   80.000000  512.329200    1.000000    1.000000

In [13]:
sum(inputs.Fare[inputs.Pclass == 1])*1000

18177412.499999985

In [24]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [25]:
inputs.describe()

           Pclass         Age        Fare      female        male
count  891.000000  891.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118   32.204208    0.352413    0.647587
std      0.836071   13.002015   49.693429    0.477990    0.477990
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   22.000000    7.910400    0.000000    0.000000
50%      3.000000   29.699118   14.454200    0.000000    1.000000
75%      3.000000   35.000000   31.000000    1.000000    1.000000
max      3.000000   80.000000  512.329200    1.000000    1.000000

In [26]:
inputs.columns

Index(['Pclass', 'Age', 'Fare', 'female', 'male'], dtype='object')

In [27]:
for i in inputs.columns:
    print(len(inputs[i].unique()))

3
89
248
2
2

In [18]:
print(abs(inputs.Age.min() -  inputs.Age.max()) )

79.58

In [19]:
print(abs(inputs.Fare.min() -  inputs.Fare.max()) )

512.3292

In [20]:
from sklearn.preprocessing import MinMaxScaler

In [40]:
for i in range(len(inputs)):
    inputs.Fare[i] = inputs.Fare[i]/ inputs.Fare.max()
inputs

<ipython-input-40-c2ab08ecdd31>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs.Fare[i] = inputs.Fare[i]/ inputs.Fare.max()

     Pclass       Age      Fare  female  male
0         3  0.275000  0.014151       0     1
1         1  0.475000  0.139136       1     0
2         3  0.325000  0.015469       1     0
3         1  0.437500  0.103644       1     0
4         3  0.437500  0.015713       0     1
..      ...       ...       ...     ...   ...
886       2  0.843750  0.433333       0     1
887       1  0.593750  1.000000       1     0
888       3  0.390116  0.781667       1     0
889       1  0.812500  1.000000       0     1
890       3  1.000000  1.000000       0     1

[891 rows x 5 columns]

In [41]:
for i in range(len(inputs)):
    inputs.Age[i] = inputs.Age[i]/ inputs.Age.max()
inputs

<ipython-input-41-14b0ebfdbd9d>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs.Age[i] = inputs.Age[i]/ inputs.Age.max()

     Pclass       Age      Fare  female  male
0         3  0.275000  0.014151       0     1
1         1  0.475000  0.139136       1     0
2         3  0.325000  0.015469       1     0
3         1  0.437500  0.103644       1     0
4         3  0.437500  0.015713       0     1
..      ...       ...       ...     ...   ...
886       2  0.843750  0.433333       0     1
887       1  0.593750  1.000000       1     0
888       3  0.390116  0.781667       1     0
889       1  0.812500  1.000000       0     1
890       3  1.000000  1.000000       0     1

[891 rows x 5 columns]

In [42]:
inputs.Fare

0      0.014151
1      0.139136
2      0.015469
3      0.103644
4      0.015713
         ...
886    0.433333
887    1.000000
888    0.781667
889    1.000000
890    1.000000
Name: Fare, Length: 891, dtype: float64

In [43]:
inputs

     Pclass       Age      Fare  female  male
0         3  0.275000  0.014151       0     1
1         1  0.475000  0.139136       1     0
2         3  0.325000  0.015469       1     0
3         1  0.437500  0.103644       1     0
4         3  0.437500  0.015713       0     1
..      ...       ...       ...     ...   ...
886       2  0.843750  0.433333       0     1
887       1  0.593750  1.000000       1     0
888       3  0.390116  0.781667       1     0
889       1  0.812500  1.000000       0     1
890       3  1.000000  1.000000       0     1

[891 rows x 5 columns]

In [28]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [30]:
from sklearn.naive_bayes import GaussianNB # binary classification 
model = GaussianNB()

In [31]:
model.fit(X_train,y_train)

GaussianNB()

In [32]:
model.score(X_test,y_test)

0.7877094972067039

In [33]:
model.score(X_train,y_train)

0.7794943820224719

In [22]:
X_test[0:10]

     Pclass        Age      Fare  female  male
700       1  18.000000  227.5250       1     0
267       3  25.000000    7.7750       0     1
142       3  24.000000   15.8500       1     0
839       1  29.699118   29.7000       0     1
873       3  47.000000    9.0000       0     1
188       3  40.000000   15.5000       0     1
302       3  19.000000    0.0000       0     1
132       3  47.000000   14.5000       1     0
624       3  21.000000   16.1000       0     1
786       3  18.000000    7.4958       1     0

In [28]:
y_test[0:10]

636    0
393    1
170    0
658    0
849    1
299    1
69     0
583    0
532    0
821    1
Name: Survived, dtype: int64

In [29]:
model.predict(X_test[0:10])

array([0, 1, 0, 0, 1, 1, 0, 0, 0, 0], dtype=int64)

In [30]:
model.predict_proba(X_test[:10])

array([[9.89228678e-01, 1.07713217e-02],
       [3.10477961e-04, 9.99689522e-01],
       [9.34383263e-01, 6.56167371e-02],
       [9.75444309e-01, 2.45556905e-02],
       [1.31625248e-03, 9.98683748e-01],
       [2.41005432e-10, 1.00000000e+00],
       [9.88445674e-01, 1.15543261e-02],
       [9.14648061e-01, 8.53519390e-02],
       [9.86842363e-01, 1.31576368e-02],
       [9.88591373e-01, 1.14086271e-02]])

**Calculate the score using cross validation**

In [34]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=10)

array([0.81944444, 0.80555556, 0.73239437, 0.83098592, 0.84507042,
       0.8028169 , 0.73239437, 0.8028169 , 0.71830986, 0.73239437])